# Tap definitions
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "buo/cask-upgrade"
tap "colindean/fonts-nonfree"
brew "mas"

# Configure
cask_args appdir: "~/Applications"

# Basics

brew "openjdk"
brew "git"
brew "git-lfs"
brew "jq"
brew "base64"
brew "openssl@3"
brew "brotli"
brew "coreutils"
brew "findutils"
brew "gnu-time"
brew "gnu-tar"
brew "gnu-sed"
brew "gawk"
brew "gnutls"
brew "gnu-indent"
brew "gnu-getopt"
brew "grep"
brew "ruby"
brew "python3"
brew "wget"
brew "tree"
cask "bettertouchtool"
cask "font-microsoft-office"
cask "macmediakeyforwarder"
mas "Xcode", id: 497799835

# Browsers

cask "firefox"
cask "google-chrome"

# Documents & Graphics

cask "adobe-acrobat-reader"
cask "adobe-creative-cloud"
cask "gimp"
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "The Unarchiver", id: 425424353
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704

# Communication

cask "skype"

# Entertainment

cask "spotify"
cask "vlc"

# Diagnostics

cask "iterm2"
brew "iperf3"

# Completion
brew "bash-completion@2"
